# SetCellStyle Method (Int32, TableCellStyle)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..SetCellStyle Method (Int32, TableCellStyle)
TableSectionData Class See Also
---
Sets a column's style.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetCellStyle(
	int nCol,
	TableCellStyle Style
)
```

Visual Basic
---
```text
Public Sub SetCellStyle ( _
	nCol As Integer, _
	Style As TableCellStyle _
)
```

Visual C++
---
```text
public:
void SetCellStyle(
	int nCol,
	TableCellStyle^ Style
)
```

# ### Parameters
nCol
    Type: System..::..Int32
Style
    Type: Autodesk.Revit.DB..::..TableCellStyle
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableSectionData Class
SetCellStyle Overload
Autodesk.Revit.DB Namespace